<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Validation Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines contain the default error messages used by
    | the validator class Some of these rules have multiple versions such
    | as the size rules Feel free to tweak each of these messages here
    |
    */

    'accepted' => 'يجب قبول السمة',
    'phone' => ' رقم الجوال يجب أن يكون رقمًا صالحًا',
    'active_url' => 'السمة ليست عنوان رابط صالحًا',
    'after' => 'يجب أن تكون السمة تاريخًا بعد التاريخ',
    'after_or_equal' => 'يجب أن تكون السمة تاريخًا بعد التاريخ أو مساويًا له',
    'alpha' => 'لا يجوز أن تحتوي السمة إلا على أحرف',
    'alpha_dash' => 'لا يجوز أن تحتوي السمة إلا على أحرف وأرقام وشرطات وشرطات سفلية',
    'alpha_num' => 'لا يجوز أن تحتوي السمة إلا على أحرف وأرقام',
    'array' => 'يجب أن تكون السمة مصفوفة',
    'before' => 'يجب أن تكون السمة تاريخًا قبل التاريخ',
    'before_or_equal' => 'يجب أن تكون السمة تاريخًا يسبق التاريخ أو مساويًا له',
    'between' => [
        'numeric' => 'يجب أن تكون السمة بين الحد الأدنى والحد الأقصى',
        'file' => 'يجب أن تكون السمة بين الحد الأدنى - الحد الأقصى كيلوبايت',
        'string' => 'يجب أن تكون السمة بين الحد الأدنى والحد الأقصى من الأحرف',
        'array' => 'يجب أن تحتوي السمة على ما بين الحد الأدنى والحد الأقصى للعنصر',
    ],
    'boolean' => 'يجب أن يكون حقل السمة صحيحًا أو خطأً',
    'confirmed' => 'تأكيد السمة غير مطابق',
    'date' => 'السمة ليست تاريخًا صالحًا',
    'date_equals' => 'يجب أن تكون السمة تاريخًا مساويًا لـ التاريخ',
    'date_format' => 'السمة لا تطابق التنسيق format',
    'different' => 'يجب أن يكون السمة و الآخر مختلفين',
    'digits' => 'يجب أن تكون السمة أرقامًا وأرقامًا',
    'digits_between' => 'يجب أن تكون السمة بين الحد الأدنى للأرقام',
    'dimensions' => 'السمة لها أبعاد صورة غير صالحة',
    'distinct' => 'حقل السمة له قيمة مكررة',
    'email' => 'يجب أن تكون السمة عنوان بريد إلكتروني صالحًا',
    'ends_with' => 'يجب أن تنتهي السمة بإحدى القيم التالية',
    'exists' => 'السمة المحددة غير صالحة',
    'file' => 'يجب أن تكون السمة ملفًا',
    'filled' => 'يجب أن يحتوي حقل السمة على قيمة',
    'gt' => [
        'numeric' => 'يجب أن تكون السمة أكبر من القيمة',
        'file' => 'يجب أن تكون السمة أكبر من قيمة كيلوبايت',
        'string' => 'يجب أن تكون السمة أكبر من أحرف القيمة',
        'array' => 'يجب أن تحتوي السمة على أكثر من عناصر ذات قيمة',
    ],
    'gte' => [
        'numeric' => 'يجب أن تكون السمة أكبر من أو تساوي القيمة',
        'file' => 'يجب أن تكون السمة أكبر من أو تساوي قيمة كيلوبايت',
        'string' => 'يجب أن تكون السمة أكبر من أو تساوي عدد الأحرف',
        'array' => 'يجب أن تحتوي السمة على عناصر ذات قيمة أو أكثر',
    ],
    'image' => 'يجب أن تكون السمة صورة',
    'in' => 'السمة المحددة غير صالحة',
    'in_array' => 'حقل السمة غير موجود في أخرى',
    'integer' => 'يجب أن تكون السمة عددًا صحيحًا',
    'ip' => 'يجب أن تكون السمة عنوان IP صالحًا',
    'ipv4' => 'يجب أن تكون السمة عنوان IPv4 صالحًا',
    'ipv6' => 'يجب أن تكون السمة عنوان IPv6 صالحًا',
    'json' => 'يجب أن تكون السمة سلسلة JSON صالحة',
    'lt' => [
        'numeric' => 'يجب أن تكون السمة أقل من قيمة',
        'file' => 'يجب أن تكون السمة أقل من قيمة كيلوبايت',
        'string' => 'يجب أن تكون السمة أقل من أحرف القيمة',
        'array' => 'يجب أن تحتوي السمة على عناصر أقل من القيمة',
    ],
    'lte' => [
        'numeric' => 'يجب أن تكون السمة أقل من أو تساوي قيمة',
        'file' => 'يجب أن تكون السمة أقل من أو تساوي قيمة كيلوبايت',
        'string' => 'يجب أن تكون السمة أقل من أو تساوي أحرف القيمة',
        'array' => 'يجب ألا تحتوي السمة على أكثر من عناصر ذات قيمة',
    ],
    'max' => [
        'numeric' => 'قد لا تكون السمة أكبر من الحد الأقصى',
        'file' => 'لا يجوز أن تكون السمة أكبر من الحد الأقصى للكيلو بايت',
        'string' => 'لا يجوز أن تكون السمة أكبر من الحد الأقصى لعدد الأحرف',
        'array' => 'لا يجوز أن تحتوي السمة على أكثر من كحد أقصى من العناصر',
    ],
    'mimes' => 'يجب أن تكون السمة ملفًا من قيم النوع',
    'mimetypes' => 'يجب أن تكون السمة ملفًا من قيم النوع',
    'min' => [
        'numeric' => 'يجب أن تكون السمة على الأقل دقيقة',
        'file' => 'يجب ألا يقل حجم السمة عن كيلو بايت',
        'string' => 'يجب أن تكون السمة على الأقل من الأحرف',
        'array' => 'يجب أن تحتوي السمة على أقل عدد من العناصر',
    ],
    'not_in' => 'السمة المحددة غير صالحة',
    'not_regex' => 'تنسيق السمة غير صالح',
    'numeric' => 'يجب أن تكون السمة رقمًا',
    'password' => 'كلمة المرور غير صحيحة',
    'present' => 'يجب أن يكون حقل السمة موجودًا',
    'regex' => 'تنسيق السمة غير صالح',
    'required' => ' حقل السمة مطلوب',
    'required_if' => 'يكون حقل السمة مطلوبًا عندما الآخر هو القيمة',
    'required_unless' => 'حقل السمة مطلوب إلا إذا كان الآخر في قيم',
    'required_with' => 'يكون حقل السمة مطلوبًا عندما تكون القيم موجودة',
    'required_with_all' => 'يكون حقل السمة مطلوبًا عندما تكون القيم موجودة',
    'required_without' => 'يكون حقل السمة مطلوبًا عندما القيم غير موجودة',
    'required_without_all' => 'يكون حقل السمة مطلوبًا في حالة عدم وجود أي من قيم',
    'same' => 'يجب أن يتطابق السمة والآخر',
    'size' => [
        'numeric' => 'يجب أن تكون السمة الحجم',
        'file' => 'يجب أن تكون السمة الحجم كيلوبايت',
        'string' => 'يجب أن تكون السمة حجم الأحرف',
        'array' => 'يجب أن تحتوي السمة على حجم العناصر',
    ],
    'starts_with' => 'يجب أن تبدأ السمة بأحد القيم التالية',
    'string' => 'يجب أن تكون السمة نص',
    'timezone' => 'يجب أن تكون السمة منطقة صالحة',
    'unique' => 'تم استخدام السمة بالفعل',
    'uploaded' => 'فشل تحميل السمة',
    'url' => 'تنسيق السمة غير صالح',
    'uuid' => 'يجب أن تكون السمة UUID صالحًا',

    /*
    |--------------------------------------------------------------------------
    | Custom Validation Language Lines
    |--------------------------------------------------------------------------
    |
    | Here you may specify custom validation messages for attributes using the
    | convention "attributerule" to name the lines This makes it quick to
    | specify a specific custom language line for a given attribute rule
    |
    */

    'custom' => [
        'attribute-name' => [
            'rule-name' => 'custom-message',
        ],
    ],

    /*
    |--------------------------------------------------------------------------
    | Custom Validation Attributes
    |--------------------------------------------------------------------------
    |
    | The following language lines are used to swap our attribute placeholder
    | with something more reader friendly such as "E-Mail Address" instead
    | of "email" This simply helps us make our message more expressive
    |
    */

    'attributes' => [
        "ar.image" => "الصورة العربية",
        "en.image" => "الصورة الأنجليزية"

    ],

];
